БИТУправление_медицинским_центром_демо/src/Catalogs/ЭквайринговыеТерминалы/ЭквайринговыеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭквайринговыеТерминалы</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыСпособовОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.СоглашенияСтрахования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭТАвтономно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОповещатьОбОтсутствииНомераСлипЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяТочкаСБП</name>
    <type>
      <types>CatalogRef.НастройкиИнтеграцииСПлатежнымиСистемами</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьПодтверждениеОплатыАвтономногоЭТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючОрганизацииНСПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНСПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючКассыНСПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайрингНСПК</name>
    <type>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ПодключаемоеОборудование</name>
      <type>
        <types>CatalogRef.ПодключаемоеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыСпособовОплат/ТипыСпособовОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСпособовОплат</name>
  <enumValues>
    <name>Эквайринг</name>
  </enumValues>
  <enumValues>
    <name>СБП</name>
  </enumValues>
  <enumValues>
    <name>СертификатНСПК</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ЭквайринговыеТерминалы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Тип.Пустая() Тогда
		Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.Эквайринг");
	КонецЕсли;
	
	НастроитьФормуПоТипу();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Если Объект.Тип <> ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.СБП") Тогда
		Объект.ТорговаяТочкаСБП = Неопределено;
	КонецЕсли;
	
	НастроитьФормуПоТипу();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЭТАвтономноПриИзменении(Элемент)
	НастроитьФормуПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИспользоватьЭТАвтономно()
	Элементы.Оборудование.ТолькоПросмотр = Объект.ИспользоватьЭТАвтономно;
	Элементы.НеОповещатьОбОтсутствииНомераСлипЧека.ТолькоПросмотр = Объект.ИспользоватьЭТАвтономно;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭквайрингНСПКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ВыборЭТЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.ЭквайринговыеТерминалы.Форма.ФормаВыбораЭквайрингаНСПК",, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭТЗавершение(Результат, ДополнительныеПарамерты) Экспорт
	
	Объект.ЭквайрингНСПК = Результат;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФормуПоТипу()
	
	ЭтоЭТ	 = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.Эквайринг");
	ЭтоСБП	 = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.СБП");
	ЭтоНСПК	 = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.СертификатНСПК");
	ЭтоПрочее = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.Прочее");
	ЭтоПрочее = ЭтоПрочее Или Не ЗначениеЗаполнено(Объект.Тип);
	
	Если ЭтоЭТ Тогда
		Элементы.СтраницыПоТипу.ТекущаяСтраница = Элементы.СтраницаНастройкиЭТ;
		
		Элементы.ГруппаПодключаемоеОбоудование.Доступность = Не Объект.ИспользоватьЭТАвтономно;
		Элементы.НеОповещатьОбОтсутствииНомераСлипЧека.Доступность = Не Объект.ИспользоватьЭТАвтономно;
		Элементы.ЗапрашиватьПодтверждениеОплатыАвтономногоЭТ.Доступность = Объект.ИспользоватьЭТАвтономно;
		
	ИначеЕсли ЭтоСБП Тогда
		Элементы.СтраницыПоТипу.ТекущаяСтраница = Элементы.СтраницаНастройкиСБП;
	ИначеЕсли ЭтоНСПК Тогда
		Элементы.СтраницыПоТипу.ТекущаяСтраница = Элементы.СтраницаНастройкиНСПК;
	Иначе
		Элементы.СтраницыПоТипу.ТекущаяСтраница = Элементы.СтраницаНастройкиПрочее;
	КонецЕсли;
	
	Элементы.Касса.Доступность = Не ЭтоНСПК;
	
КонецПроцедуры

#КонецОбласти
